import math


def area(r):
    '''
    Вычисляет площадь круга по заданному радиусу.

    Параметры:
        r : радиус круга

    Возвращаемое значение:
        result : площадь круга

    Пример вызова: area(5) = 78.53981633974483
    '''

    return math.pi * r * r


def perimeter(r):
    '''
    Вычисляет длину окружности круга по заданному радиусу.

    Параметры:
        r : радиус круга

    Возвращаемое значение:
        result : длина окружности

    Пример вызова: perimeter(9) = 56.548667764616276
    '''
    return 2 * math.pi * r