
def area(a, b): 
    '''
    Вычисляет площадь прямоугольника по длинам его сторон.

    Параметры:
        a: длина первой стороны прямоугольника
        b: длина второй стороны прямоугольника

    Возвращаемое значение:
        result: площадь прямоугольника

    Пример вызова:
        area(4, 6) = 24
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Вычисляет периметр прямоугольника по длинам его сторон.

    Параметры:
        a: длина первой стороны прямоугольника
        b: длина второй стороны прямоугольника

    Возвращаемое значение:
        result: периметр прямоугольника

    Пример вызова:
        perimeter(2, 3) = 10
    '''
    return (a + b) * 2