
def area(a):
    '''
    Вычисляет площадь квадрата по длине его стороны.

    Параметры:
        a: длина стороны квадрата

    Возвращаемое значение:
        result: площадь квадрата

    Пример вызова:
        area(5) = 25
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата по длине его стороны.

    Параметры:
        a: длина стороны квадрата

    Возвращаемое значение:
        result: периметр квадрата

    Пример вызова:
        perimeter(5) = 20
    '''
    return 4 * a
